[
   {
      "Title":"Strategic Events and Operations Coodinator",
      "Last name":"Hanawahine",
      "First name":"Le'a",
      "Bio":"Le'a was born and raised in Waimānalo, Hawai'i, the place that first taught her the true meaning of mālama. Growing up in Hawai'i, Le'a has developed a lifelong love for nature, especially the beach, animals, and ʻono food! <br /><br />Le'a is a recent graduate of Creighton University in Omaha, Nebraska, where she obtained her Bachelor of Science in Business Administration with a major in Marketing and a concentration in Strategic Communications. During her undergraduate studies, Le'a completed the Pre-Health Sciences Program, was an active member of many on-campus clubs, and volunteered for organizations that emphasized service for underserved communities. Le'a is currently pursuing her Master of Public Health and Master of Business Administration programs, where she looks forward to applying her studies to her work with HCAN.<br /><br />From a young age, Le'a has always found herself passionate about working and volunteering for non-profits such as Shriners Hospital for Children and the Special Olympics. She is more than excited to continue her work with Hawai'i Children Action Network, as she looks forward to serving the children and families of Hawai'i. ",
      "Description HTML":"<p>Le'a was born and raised in Waimānalo, Hawai'i, the place that first taught her the true meaning of mālama. Growing up in Hawai'i, Le'a has developed a lifelong love for nature, especially the beach, animals, and ʻono food! <br /><br />Le'a is a recent graduate of Creighton University in Omaha, Nebraska, where she obtained her Bachelor of Science in Business Administration with a major in Marketing and a concentration in Strategic Communications. During her undergraduate studies, Le'a completed the Pre-Health Sciences Program, was an active member of many on-campus clubs, and volunteered for organizations that emphasized service for underserved communities. Le'a is currently pursuing her Master of Public Health and Master of Business Administration programs, where she looks forward to applying her studies to her work with HCAN.<br /><br />From a young age, Le'a has always found herself passionate about working and volunteering for non-profits such as Shriners Hospital for Children and the Special Olympics. She is more than excited to continue her work with Hawai'i Children Action Network, as she looks forward to serving the children and families of Hawai'i. </p>",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729180737/Hanawahine_Le'a.jpg?1729180737"
   },
   {
      "Title":"Creative Specialist",
      "Last name":"Felicitas",
      "First name":"Philamer",
      "Bio":"Born and raised in Hawaiʻi, Philamer is a digital creative and storyteller who uses her experience to support nonprofits and social justice organizations in Phoenix, Arizona. She has spent the last eight years empowering local small Asian owned businesses with the Arizona Asian Chamber of Commerce, raising funds to support Arizona State University’s Foundation, and advocating for marginalized communities against racism and inequity with organizations like BLM Phoenix Metro and Poder in Action.\n\nShe still calls Hawaiʻi home and is looking forward to moving back soon. She loves a good poke bowl, island music, and going to the beach with her toddler.\n",
      "Description HTML":"<p>Born and raised in Hawaiʻi, Philamer is a digital creative and storyteller who uses her experience to support nonprofits and social justice organizations in Phoenix, Arizona. She has spent the last eight years empowering local small Asian owned businesses with the Arizona Asian Chamber of Commerce, raising funds to support Arizona State University’s Foundation, and advocating for marginalized communities against racism and inequity with organizations like BLM Phoenix Metro and Poder in Action.</p>\n\n<p>She still calls Hawaiʻi home and is looking forward to moving back soon. She loves a good poke bowl, island music, and going to the beach with her toddler.</p>\n",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729180736/Felicitas_Philamer.png"
   },
   {
      "Title":"Director of Research and Economic Policy",
      "Last name":"Woo",
      "First name":"Nicole",
      "Bio":"Nicole is the Director of Research and Economic Policy. She focuses on the economic empowerment of Hawai‘i's families and children through tools such as the state budget, tax credits for working families, and food security. She has over two decades of policy and research experience looking into childhood hunger, work-family support strategies, wages and economic inequality, and tax and budget policies, at non-profit organizations and think tanks in New York City; Washington, DC; Bangalore, India; and Hawaii. Nicole received her B.A. from Harvard University, where she concentrated in Government.",
      "Description HTML":"<p>Nicole is the Director of Research and Economic Policy. She focuses on the economic empowerment of Hawai‘i's families and children through tools such as the state budget, tax credits for working families, and food security. She has over two decades of policy and research experience looking into childhood hunger, work-family support strategies, wages and economic inequality, and tax and budget policies, at non-profit organizations and think tanks in New York City; Washington, DC; Bangalore, India; and Hawaii. Nicole received her B.A. from Harvard University, where she concentrated in Government.</p>",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729277181/Woo_Nicole.jpg"
   },
   {
      "Title":"Director of Early Childhood and Health Policy",
      "Last name":"Davis",
      "First name":"Chevelle",
      "Bio":"Chevelle was born and raised on the island of O‘ahu and resides in the ahupua‘a of Hono‘uli‘uli. She was raised in a blended family and is the oldest of six children. Chevelle loves to travel, eat ‘ono food, watch movies, and make memories with her family, friends, and pets. Chevelle comes from a public health background focused on health policy, with a Bachelor's, Master's, and is currently pursuing her Ph.D. in public health from the University of Hawai‘i at Mānoa. Chevelle is also a Robert Wood Johnson Foundation Health Policy Research Scholar, a leadership development program for doctoral students from populations underrepresented in specific doctoral disciplines and/or historically marginalized backgrounds, whose aim is to support scholars in becoming effective leaders of change and challenge structural systems of power. Chevelle is passionate about creating a future where communities feel safe and supported across Hawai‘i by addressing social, structural, and political determinants of health. In her role as Director of Early Childhood and Health Policy, she supports community in advocating for policies that support families in raising their keiki and caring for their ‘ohana in a healthy, safe, and supportive Hawai‘i. She brings passion for community-centered policies informed by anti-racism, equity, and justice, with the goal of systems change. Chevelle’s prior experience includes research and advocacy on sexual reproductive health and rights, and Native Hawaiian Health.",
      "Description HTML":"<p>Chevelle was born and raised on the island of O‘ahu and resides in the ahupua‘a of Hono‘uli‘uli. She was raised in a blended family and is the oldest of six children. Chevelle loves to travel, eat ‘ono food, watch movies, and make memories with her family, friends, and pets. <br /><br />Chevelle comes from a public health background focused on health policy, with a Bachelor's, Master's, and is currently pursuing her Ph.D. in public health from the University of Hawai‘i at Mānoa. Chevelle is also a Robert Wood Johnson Foundation Health Policy Research Scholar, a leadership development program for doctoral students from populations underrepresented in specific doctoral disciplines and/or historically marginalized backgrounds, whose aim is to support scholars in becoming effective leaders of change and challenge structural systems of power.<br /><br />Chevelle is passionate about creating a future where communities feel safe and supported across Hawai‘i by addressing social, structural, and political determinants of health. In her role as Director of Early Childhood and Health Policy, she supports community in advocating for policies that support families in raising their keiki and caring for their ‘ohana in a healthy, safe, and supportive Hawai‘i. She brings passion for community-centered policies informed by anti-racism, equity, and justice, with the goal of systems change. Chevelle’s prior experience includes research and advocacy on sexual reproductive health and rights, and Native Hawaiian Health.</p>",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729277196/Davis_Chevelle.jpg"
   },
   {
      "Title":"Family Engagement Coordinator",
      "Last name":"Baba",
      "First name":"Krystal",
      "Bio":"Krystal envisions to sustain her role by bridging her dedication of building community partnerships to her grassroots. Her passion to support local communities is driven by her upbringing from Waipahu, Hawaiʻi, which also motivated her educational path. She received a Master of Public Administration degree and a Bachelor of Science in Criminal Justice Administration, with a concentration in Management, from the University of Phoenix while juggling multiple community roles. Her work connects through domestic violence advocacy, underage substance misuse prevention, sexual violence prevention, and supporting various community coalitions. She truly does it all for her daughter and her family, fur babies included.",
      "Description HTML":"<p>Krystal envisions to sustain her role by bridging her dedication of building community partnerships to her grassroots. Her passion to support local communities is driven by her upbringing from Waipahu, Hawaiʻi, which also motivated her educational path. She received a Master of Public Administration degree and a Bachelor of Science in Criminal Justice Administration, with a concentration in Management, from the University of Phoenix while juggling multiple community roles. Her work connects through domestic violence advocacy, underage substance misuse prevention, sexual violence prevention, and supporting various community coalitions. She truly does it all for her daughter and her family, fur babies included.</p>",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729277198/Baba_Krystal.jpg"
   },
   {
      "Title":"Deputy Director",
      "Last name":"Velazquez",
      "First name":"Courtney",
      "Bio":"Courtney grew up in the red dirt of Central Oʻahu. She has 20+ years of experience working in government and nonprofit organizations in Honolulu and Seattle. Her philosophy is to get resources to change-makers and get out of the way. For the past 12 years, she worked alongside community partners to address homelessness, gender-based violence, and labor protections. Prior to that, she advocated with youth to access post-secondary opportunities and taught adult English language learners. Courtney is deeply grateful to community organizer mentors for showing her how to translate racial equity principles into actions. She is excited to be back in Hawai'i to contribute to the place and people that raised her. She received her master's degree in public administration from the University of Hawaiʻi at Mānoa and she speaks Spanish. She loves to travel, surf, fish, read, and hang out with family.",
      "Description HTML":"<p>Courtney grew up in the red dirt of Central Oʻahu. She has 20+ years of experience working in government and nonprofit organizations in Honolulu and Seattle. Her philosophy is to get resources to change-makers and get out of the way. For the past 12 years, she worked alongside community partners to address homelessness, gender-based violence, and labor protections. Prior to that, she advocated with youth to access post-secondary opportunities and taught adult English language learners.<br /><br />Courtney is deeply grateful to community organizer mentors for showing her how to translate racial equity principles into actions. She is excited to be back in Hawai'i to contribute to the place and people that raised her. She received her master's degree in public administration from the University of Hawaiʻi at Mānoa and she speaks Spanish. She loves to travel, surf, fish, read, and hang out with family.</p>",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729277183/Velazquez_Courtney.jpg"
   },
   {
      "Title":"WIC Language Access Project Coordinator",
      "Last name":"Whiting",
      "First name":"Gwen",
      "Bio":"Born and raised on the island of Oʻahu, Gwen is an alumnus of the Hawai’i Parent Leadership Training Institute (PLTI). She has worked with various sectors as an Education Consultant, helping to develop, implement, and improve a diverse range of programs for keiki. She aims to actively support opportunities and resources for families in Hawai’i. Gwen is excited and honored to bring more awareness, create more accessibility, and promote participation in WIC benefits offered to families in our state. She hopes that the work done here can be utilized to benefit people across the nation.",
      "Description HTML":"<p>Born and raised on the island of Oʻahu, Gwen is an alumnus of the Hawai’i Parent Leadership Training Institute (PLTI). She has worked with various sectors as an Education Consultant, helping to develop, implement, and improve a diverse range of programs for keiki. She aims to actively support opportunities and resources for families in Hawai’i. Gwen is excited and honored to bring more awareness, create more accessibility, and promote participation in WIC benefits offered to families in our state. She hopes that the work done here can be utilized to benefit people across the nation.</p>",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729277181/Whiting_Gwen.jpg"
   },
   {
      "Title":"Executive Director",
      "Last name":"Zysman",
      "First name":"Deborah",
      "Bio":"Deborah provides overall leadership at HCAN and works with the Board of Directors and community partners to improve the lives of children. Deborah previously served as Executive Director of Coalition for Tobacco-Free Hawaii from 2003 to 2012. The non-profit advanced Hawaii’s smoke-free workplace and tax laws and achieved a substantial decrease in smoking rates. She has a master’s degree in public health from the University of North Carolina at Chapel Hill and her work has spanned chronic disease, HIV/AIDS, substance abuse prevention, women’s health, and community health. Her work has focused on public policy, advocacy, organizational capacity building, and developing community coalitions. Deborah is a Weinberg Fellow and the winner of the 2017 AIM for Excellence in Nonprofit Management award. Deborah and was named one of Hawaii’s “Forty Under 40” by Pacific Business News and she is the past board President of Hawaii Public Health Association and the Junior League of Honolulu. In her spare time, she enjoys yoga, reading and going to the beach with her long-time partner and their two young children.",
      "Description HTML":"<p>Deborah provides overall leadership at HCAN and works with the Board of Directors and community partners to improve the lives of children. Deborah previously served as Executive Director of Coalition for Tobacco-Free Hawaii from 2003 to 2012. The non-profit advanced Hawaii’s smoke-free workplace and tax laws and achieved a substantial decrease in smoking rates.<br /><br />She has a master’s degree in public health from the University of North Carolina at Chapel Hill and her work has spanned chronic disease, HIV/AIDS, substance abuse prevention, women’s health, and community health. Her work has focused on public policy, advocacy, organizational capacity building, and developing community coalitions.<br /><br />Deborah is a Weinberg Fellow and the winner of the 2017 AIM for Excellence in Nonprofit Management award. Deborah and was named one of Hawaii’s “Forty Under 40” by Pacific Business News and she is the past board President of Hawaii Public Health Association and the Junior League of Honolulu.<br /><br />In her spare time, she enjoys yoga, reading and going to the beach with her long-time partner and their two young children.</p>",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729277176/Zysman_Deborah.jpg"
   },
   {
      "Title":"Children’s Health and Wellness Policy Advocate",
      "Last name":"Kohl",
      "First name":"Noreen",
      "Bio":"Noreen’s current role involves advocating for long-term policy solutions to improve child mental health, safety, and wellness in Hawai‘i. She brings a decade of experience on projects to address inequities through data-driven decision making, programming, and social policy in Hawai‘i. Noreen’s prior work spans issues relating to childhood health and mental health, social inequalities, and the criminal legal system. A social scientist by training, Noreen is passionate about making data accessible and using research to advance equity and social justice. She is dedicated to policy change that supports family caregivers across the life span and has worked on paid family leave, long-term care services, and equitable workplaces policies. In addition to family caregiving and gender equity, she is committed to non-punitive approaches to address problems from anti-racist and trauma-informed lenses. Noreen is grateful to be raising her two young children with her partner on Oʻahu. She enjoys swimming, spending time with family and friends, trying new places to eat, going to the beach, and reading with her kids.",
      "Description HTML":"<p>Noreen’s current role involves advocating for long-term policy solutions to improve child mental health, safety, and wellness in Hawai‘i. She brings a decade of experience on projects to address inequities through data-driven decision making, programming, and social policy in Hawai‘i. Noreen’s prior work spans issues relating to childhood health and mental health, social inequalities, and the criminal legal system. <br /><br />A social scientist by training, Noreen is passionate about making data accessible and using research to advance equity and social justice. She is dedicated to policy change that supports family caregivers across the life span and has worked on paid family leave, long-term care services, and equitable workplaces policies. In addition to family caregiving and gender equity, she is committed to non-punitive approaches to address problems from anti-racist and trauma-informed lenses.<br /><br />Noreen is grateful to be raising her two young children with her partner on Oʻahu. She enjoys swimming, spending time with family and friends, trying new places to eat, going to the beach, and reading with her kids.</p>",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729277194/Kohl_Noreen.jpeg"
   },
   {
      "Title":"Anti-Hunger Advocate",
      "Last name":"Tabangay",
      "First name":"Diane",
      "Bio":"Diane is the Anti-Hunger Advocate focusing on food insecurity and policy solutions to child hunger in Hawaii. In this role she works collaboratively with public and private entities to address gaps and barriers to food access, including participation in Child Nutrition Programs. Diane’s entire work life has been dedicated to serving children and families as an educator and program administrator.  She was born and raised on Oahu, educated through Hawaii’s public-school system, and earned a B.Ed. and M.Ed. in Elementary Education with emphasis on early childhood education and school administration.  Reflecting is her favorite past time activity, as she finds much happiness in remembering time spent with family and friends and staying in touch with them.",
      "Description HTML":"<p>Diane is the Anti-Hunger Advocate focusing on food insecurity and policy solutions to child hunger in Hawaii. In this role she works collaboratively with public and private entities to address gaps and barriers to food access, including participation in Child Nutrition Programs. Diane’s entire work life has been dedicated to serving children and families as an educator and program administrator.  She was born and raised on Oahu, educated through Hawaii’s public-school system, and earned a B.Ed. and M.Ed. in Elementary Education with emphasis on early childhood education and school administration.  Reflecting is her favorite past time activity, as she finds much happiness in remembering time spent with family and friends and staying in touch with them.</p>",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729277189/Tabangay_Diane.jpg"
   },
   {
      "Title":"Director of Community Engagement and Training",
      "Last name":"Andrade",
      "First name":"Mele",
      "Bio":"Mele grew up on the island of Maui where she honed her abilities to nurture and support the children and families of her community. With over 19 years of experience, Mele continues to effect positive change through home visitation and child abuse and neglect prevention. Mele is grateful for the opportunity to raise her four children on Maui. When she is not working, she loves spending time with them. In her role as Director of Community Engagement and Training, she supports the children and families of Hawaiʻi in building healthy and strong communities. Mele earned her BS in Psychology from The University of Southern California. She received her MSCP, Master of Science in Counseling Psychology, focusing on Marriage and Family Therapy, from Chaminade University.",
      "Description HTML":"<p>Mele grew up on the island of Maui where she honed her abilities to nurture and support the children and families of her community.<br /><br />With over 19 years of experience, Mele continues to effect positive change through home visitation and child abuse and neglect prevention.<br /><br />Mele is grateful for the opportunity to raise her four children on Maui. When she is not working, she loves spending time with them.<br /><br />In her role as Director of Community Engagement and Training, she supports the children and families of Hawaiʻi in building healthy and strong communities.<br /><br />Mele earned her BS in Psychology from The University of Southern California. She received her MSCP, Master of Science in Counseling Psychology, focusing on Marriage and Family Therapy, from Chaminade University.</p>",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729277199/Andrade_Mele.jpg"
   },
   {
      "Title":"Children’s Health Coordinator",
      "Last name":"Hall",
      "First name":"Mai Kapuaoʻihilani Mei-Lin",
      "Bio":"Mai was born and raised in Kalihi, Oʻahu. As a former preschool teacher, public school teacher, Hawaiian culture Kumu, and non-profit program manager, Mai brings a diverse perspective to the field of early learning as an early childhood advocate for over 18 years. She has worked and volunteered in a variety of settings including center based care, family child care, family-child interaction learning programs, shelters, Department of Education, and Kamehameha Schools. Mai received both her B.Ed. and M.Ed. from the University of Hawaiʻi at Mānoa with an emphasis in early childhood education and Hawaiian culture. She has served on the Executive Board for the Hawaiʻi affiliate chapter for the National Association for the Education of Young Children (HiAEYC) for seven years which fueled her advocacy efforts for preschool providers and children. Mai serves as the Co-Chair of the Honolulu Community Children’s Council (CCC) and as a parent representative on the Special Education Advisory Council (SEAC) to advocate for children with disabilities and special health care needs. As a parent of two children with disabilities, she is committed to improving systems, services, and positive outcomes for our keiki.",
      "Description HTML":"<p>Mai was born and raised in Kalihi, Oʻahu. As a former preschool teacher, public school teacher, Hawaiian culture Kumu, and non-profit program manager, Mai brings a diverse perspective to the field of early learning as an early childhood advocate for over 18 years. She has worked and volunteered in a variety of settings including center based care, family child care, family-child interaction learning programs, shelters, Department of Education, and Kamehameha Schools.<br /><br />Mai received both her B.Ed. and M.Ed. from the University of Hawaiʻi at Mānoa with an emphasis in early childhood education and Hawaiian culture. She has served on the Executive Board for the Hawaiʻi affiliate chapter for the National Association for the Education of Young Children (HiAEYC) for seven years which fueled her advocacy efforts for preschool providers and children. Mai serves as the Co-Chair of the Honolulu Community Children’s Council (CCC) and as a parent representative on the Special Education Advisory Council (SEAC) to advocate for children with disabilities and special health care needs. As a parent of two children with disabilities, she is committed to improving systems, services, and positive outcomes for our keiki.</p>",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729277195/Hall_Mai_Kapuao%CA%BBihilani_Mei-Lin.jpg"
   },
   {
      "Title":"Food Policy Program Assistant",
      "Last name":"Pouri",
      "First name":"Sheilan",
      "Bio":"Born and raised in Northern Virginia, Sheilan moved to Hawaiʻi to serve as an AmeriCorps VISTA with the Hawaiʻi Afterschool Alliance. In this role, she worked extensively with HCAN to address food access gaps across the islands. Now, she works in her role to collaborate with public and private entities to tackle barriers to food access, and partners with the Hawaiʻi Afterschool Alliance to support community-wide food policy initiatives. As a pre-medical student, Sheilan has devoted her life to providing resources for underserved communities. She is excited to be part of a dedicated team working to address food access barriers! In her free time, she enjoys running, taking yoga classes, and indulging in the occasional Foodland poke bowl.",
      "Description HTML":"<p>Born and raised in Northern Virginia, Sheilan moved to Hawaiʻi to serve as an AmeriCorps VISTA with the Hawaiʻi Afterschool Alliance. In this role, she worked extensively with HCAN to address food access gaps across the islands. Now, she works in her role to collaborate with public and private entities to tackle barriers to food access, and partners with the Hawaiʻi Afterschool Alliance to support community-wide food policy initiatives.<br /><br />As a pre-medical student, Sheilan has devoted her life to providing resources for underserved communities. She is excited to be part of a dedicated team working to address food access barriers! In her free time, she enjoys running, taking yoga classes, and indulging in the occasional Foodland poke bowl.</p>",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729277193/Pouri_Sheilan.png"
   },
   {
      "Title":"Early Childhood Policy and Advocacy Coordinator",
      "Last name":"Tsuchiya",
      "First name":"Malia",
      "Bio":"Malia is a mother of five and a strong advocate for everything early childhood. She spent nearly twenty years as a direct service provider, working as a family childcare provider, infant toddler lead caregiver, and preschool teacher. She has vast experience in curriculum development, accreditation, and licensing procedures. She holds a B.A. in Psychology and Child Development, an M.Ed. in Educational Leadership with a focus on Child Development, and is currently completing her Ed.D. in Organizational Leadership. In recent years, the focus of Malia’s work has been on community organizing, the implementation of systemic quality improvements and, workforce and leadership development. She is a strong believer in the need for systems approaches to solutions. Malia believes that through the work of a strong body of early childhood advocates, Hawai’i can make the systems changes needed to become a champion for the rights our children deserve. Malia’s passion for early childhood has inspired her to reach out to the broader community to help advocate for the rights of young children, their families, and their communities. Growing up between Hawai’i Island and Kaua’i, Malia understands and respects the need for strong communities as a foundation for the wellness of young children. Malia approaches life and work from a servant leadership perspective, seeking to empower the voices of everyone who desires to create a better world for our children. Who will advocate for the rights of our children, if not us, then who?",
      "Description HTML":"<p>Malia is a mother of five and a strong advocate for everything early childhood. She spent nearly twenty years as a direct service provider, working as a family childcare provider, infant toddler lead caregiver, and preschool teacher. She has vast experience in curriculum development, accreditation, and licensing procedures. She holds a B.A. in Psychology and Child Development, an M.Ed. in Educational Leadership with a focus on Child Development, and is currently completing her Ed.D. in Organizational Leadership.<br /><br />In recent years, the focus of Malia’s work has been on community organizing, the implementation of systemic quality improvements and, workforce and leadership development. She is a strong believer in the need for systems approaches to solutions. Malia believes that through the work of a strong body of early childhood advocates, Hawai’i can make the systems changes needed to become a champion for the rights our children deserve.<br /><br />Malia’s passion for early childhood has inspired her to reach out to the broader community to help advocate for the rights of young children, their families, and their communities. Growing up between Hawai’i Island and Kaua’i, Malia understands and respects the need for strong communities as a foundation for the wellness of young children. Malia approaches life and work from a servant leadership perspective, seeking to empower the voices of everyone who desires to create a better world for our children. Who will advocate for the rights of our children, if not us, then who?</p>",
      "cached_thumbnail_url":"https://assets.nationbuilder.com/goodbeginnings/pages/2217/attachments/original/1729277184/Tsuchiya_Malia.png"
   }
]