[
  {
    "Name": "Amanda Pump",
    "Description HTML": "<p>Amanda lives with her husband, two children and three fur children in Ewa Beach, HI.  She holds a master's degree in Human Services and a Certification in Substance Abuse Counseling.  Amanda works as the Executive Vice President and Chief Program officer at Child and Family Service and has spent over fourteen years serving Hawaii's communities.  Amanda knows the importance for the need for resources having a son that needed additional support and services since he was just 10 months old.</p>\n",
    "cached_thumbnail_url": "https://raw.githubusercontent.com/kathanner/hcan/e5800280c30ee3f54f195b1a4c5f6b3cdfa51f4b/misc/olc/AmandaPump.jpg"
  },
  {
    "Name": "Axel Beers",
    "Description HTML": "<p>Axel was born and raised in Wailuku, Maui, and lives in Kahului with his three children and partner. He holds a master's degree in education and is an Executive Assistant and Policy Analyst for Councilmember Gabe Johnson. Axel is a former teacher, counselor, journalist, and editor. His hope is to work toward an economy and society where the wellbeing of local children and families is a central priority.</p>\n",
    "cached_thumbnail_url": "https://raw.githubusercontent.com/kathanner/hcan/e5800280c30ee3f54f195b1a4c5f6b3cdfa51f4b/misc/olc/AxelBeers.jpg"
  },
  {
    "Name": "Brandee Carvalho",
    "Description HTML": "<p>Brandee is a proud parent leader and passionate about her community. She serves as a member of the E Ola Hou Prevent Suicide Task Force and a certified trainer for Youth Suicide & Bullying Prevention with Mental Health America of Hawai‘i. She is a 2021 graduate of HCAN’s PLTI program and looking forward to her second year as a facilitator. Brandee continues to advocate for Mental Health and Suicide Prevention aka #Passion4Prevention and continues to advocate for our local families and pressing issues like the childcare tax credit and paid family leave. Brandee is the co-host of the KISS Morning Show with Ed Kanoi and a full time Media Consultant with Pacific Media Group, Hawai‘i’s leading and locally owned, multi-platform media company. Brandee also enjoys spending time & making memories with her ‘ohana.</p>\n",
    "cached_thumbnail_url": "https://raw.githubusercontent.com/kathanner/hcan/e5800280c30ee3f54f195b1a4c5f6b3cdfa51f4b/misc/olc/BrandeeCarvalho.png"
  },
  {
    "Name": "Christen Zulli",
    "Description HTML": "<p>Bio coming soon.</p>\n"
  },
  {
    "Name": "Gail Abrena-Agas",
    "Description HTML": "<p>Gail is a working mom of two that understands the challenges that Hawai'i families face. Her lived experiences fuel a passion to advocate for working families, protect our keiki and fight biases that harm underrepresented communities. Born and raised on O'ahu, Gail settled back home with her 'ohana in 2016 after 17 years spent in New York and California. When she's not advocating for issues that matter most to her, she works full time as a commercial property manager for Alexander & Baldwin and volunteers as a board director for the Building, Owners and Managers Association of Hawai'i. Gail currently lives in 'Aiea with her wife, 8-year-old son and 2-year-old daughter.</p>\n",
    "cached_thumbnail_url": "https://raw.githubusercontent.com/kathanner/hcan/e5800280c30ee3f54f195b1a4c5f6b3cdfa51f4b/misc/olc/GailAbrena-Agas.png"
  },
  {
    "Name": "Heidi Allencastre",
    "Description HTML": "<p>Heidi Allencastre was born and raised on Maui. She is the proud single mother of 3 keiki. She is currently finishing up her Bachelor's in Social Work degree at the University of Hawaii at Manoa, Thompson School of Social Work and Public Health. She has a passion for helping families and keiki in Maui County. Being a single mother raising keiki in Maui she knows firsthand how extremely hard it can be. She is determined to help break down some of the systemic barriers that prevent local 'ohanas from thriving in their homelands. Heidi's hope is that every parent learn to be their child's number-one advocate and hopes that through the Ohana Leadership Council, she can help give a voice to all Hawai'i families.</p>\n",
    "cached_thumbnail_url": "https://raw.githubusercontent.com/kathanner/hcan/e5800280c30ee3f54f195b1a4c5f6b3cdfa51f4b/misc/olc/HeidiAllencastre.png"
  },
  {
    "Name": "Jazzlyn Young",
    "Description HTML": "<p>Jazzlyn, better elevated as Jazzy, and even better called as mom by her three beautiful children strives to find a balance of parenting while making herself a priority. In between raising her family in Pearl City, Jazzy is also a cheer coach for Pearl City High School. She is a nurturer by nature and wishes for a healthier Hawai‘i where we can make supported decisions and not have to choose between working or watching our keiki grow up.</p>\n",
    "cached_thumbnail_url": "https://raw.githubusercontent.com/kathanner/hcan/e5800280c30ee3f54f195b1a4c5f6b3cdfa51f4b/misc/olc/JazzlynYoung.png"
  },
  {
    "Name": "Joell Edwards",
    "Description HTML": "<p>Bio coming soon.</p>\n"
  },
  {
    "Name": "Kristi Chinen",
    "Description HTML": "<p>Kristi resides in Ewa Beach with her family, extended family, and partner. She recently graduated with her bachelor’s degree in computer science with a concentration in cyber security. She joins as a leader advocating for future generations who are deciding to raise a family in Hawai‘i while recognizing our barriers, including high cost of living.</p>\n",
    "cached_thumbnail_url": "https://raw.githubusercontent.com/kathanner/hcan/e5800280c30ee3f54f195b1a4c5f6b3cdfa51f4b/misc/olc/KristiChinen.png"
  },
  {
    "Name": "Leilani Kailiawa",
    "Description HTML": "<p>Leilani supports her family in Hilo while caring for her child's medical and special needs, most of which their family navigated resources on their own. Through her lived experience she can support her role with Leadership in Disabilities and Achievemment of Hawai‘i. She has worked since the age of 15 and is now starting her own business. She understands the need for financial stability while balaning the importance of family. While working hard, Leilani earned an associate's degree in ?. There are many different values of Leilani, but most importantly community work. For the last 15 years, she continues to volunteer with Aloha Council (Boy Scouts) through various positions.</p>\n",
    "cached_thumbnail_url": "https://raw.githubusercontent.com/kathanner/hcan/e5800280c30ee3f54f195b1a4c5f6b3cdfa51f4b/misc/olc/LeilaniKailiawa.jpg"
  },
  {
    "Name": "Lynn Nguyen",
    "Description HTML": "<p>Lynn was born and raised on the island of O‘ahu and is an alumni of the University of Hawai‘i at Mānoa. Lynn is passionate and involved in many different areas including social work, education, healthcare, public health, and education. Lynn has experience working with locally undeserved families and children ranging from the ages of 0 to 18. Lynn is also on the board of the Hawai‘i Society for Technology in Education. In her free time, Lynn enjoys being outdoors and going on adventures with family and friends.</p>\n",
    "cached_thumbnail_url": "https://raw.githubusercontent.com/kathanner/hcan/e5800280c30ee3f54f195b1a4c5f6b3cdfa51f4b/misc/olc/LynnNguyen.png"
  },
  {
    "Name": "Pelenatita Namoa-Hanusa",
    "Description HTML": "<p>Pelenatita was born and raised in Lahaina, Maui. She is an alumni of Lahainaluna High School and University of Hawai‘i West O‘ahu with a bachelor's in political science. She is married and a mother to three beautiful young children. Helping to create a positive difference in the lives of others especially families is fulfilling for her and is something she hopes her children will follow when they grow up. One of her main priorities is to advocate for affordable and qualuty childcare in Hawai'i.</p>\n",
    "cached_thumbnail_url": "https://raw.githubusercontent.com/kathanner/hcan/e5800280c30ee3f54f195b1a4c5f6b3cdfa51f4b/misc/olc/PelenatitaNamoa-Hanusa.jpg"
  },
  {
    "Name": "Regina Blanchard-Walker",
    "Description HTML": "<p>Regina was born and raised in St. Louis, Missouri (MO). She has three adult daughters, one adult son, and seven grandchildren. Her adult son and two grandsons live with her on the Big Island, where she moved to in 2018 (from Jefferson City, MO), to accept a job as a high school counselor. Her husband, Army Sgt. Kyle Blake Walker, passed away shortly after moving to Hawai‘i. Regina is an advocate for parents with children of different abilities and mentored high school and college students. She is a professional vocalist and community theatre actor. Regina has a bachelor's in psychology from Columbia College MO, M.Ed in School Counseling from Lincoln University MO, post Masters degree in Mental Health Practices in Schools from University of MO Columbia, Women's Entrepreneuship Certification from Cornell University, and is currently an Education Leadership Doctoral Candidate at Chaminade University of Honolulu.</p>\n",
    "cached_thumbnail_url": "https://raw.githubusercontent.com/kathanner/hcan/e5800280c30ee3f54f195b1a4c5f6b3cdfa51f4b/misc/olc/ReginaBlanchard-Walker.jpg"
  },
  {
    "Name": "Sherrie Galdeira",
    "Description HTML": "<p>Sherrie is an advocate parent with a background in the legal and real estate arena. As a surviving victim of abuse, Sherrie became a Paralegal out of necessity, learned the language of the court and how to navigate through our local court system to help save her child from the same fate.</p>\n",
    "cached_thumbnail_url": "https://raw.githubusercontent.com/kathanner/hcan/e5800280c30ee3f54f195b1a4c5f6b3cdfa51f4b/misc/olc/SherrieGaldeira.jpg"
  },
  {
    "Name": "Zane Lacaden",
    "Description HTML": "<p>Bio coming soon.</p>\n"
  }
]