[{"org":"HCAN","date":"2024-06-21","title":"Some Hawaii businesses struggle to keep up with minimum wage raises","publication":"KITV4","excerpt":"\"Tens of thousands of minimum wage workers are our neighbors here in Hawaii. They rely on this wage to pay for their food, rent, and basic necessities and they're feeling the pressure of higher prices just like anyone else,\" said Research and Policy Director Nicole Woo.","url":"https://www.kitv.com/news/some-hawaii-businesses-struggle-to-keep-up-with-minimum-wage-raises/article_69d8deec-303f-11ef-8dac-f7066f9a7381.html","thumb":"https://airtable.com/appbaSkkzqMtMDZvn/tbldguO6qNaiSKWxH/recoWZMOpjSHCvl8M/fldklFahcv3P8s5Fb/attXtrpnxUJoZD2eQ"},{"org":"HCAN","date":"2024-06-14","title":"As Hawaii’s keiki struggle, there are ways to help","publication":"KHON2","excerpt":"Velazquez says the data shows that everything is interconnected and there is a whole ecosystem responsible for a child’s life. \"Although this data is published annually, we need to know why this is happening and how the data points are connected. When families have what they need in terms of housing, income, childcare, and when the basic necessities are met and they have stability, then kids can thrive,\"","url":"https://www.khon2.com/local-news/as-hawaiis-keiki-struggle-there-are-ways-to-help/","thumb":"https://airtable.com/appbaSkkzqMtMDZvn/tbldguO6qNaiSKWxH/recqice5b4I6Kx7nu/fldklFahcv3P8s5Fb/att0GX8y8pFW2QAHz"},{"org":"HCAN","date":"2024-06-12","title":"Fewer than half of Hawaii’s keiki proficient in reading and math","publication":"Star Advertiser","excerpt":"A new study reports that fewer than half of Hawaii’s students are proficient in reading and math and that Hawaii is ranked among the bottom third of states nationally for economic well-being, indicating a need for more state action supporting keiki and families.","url":"https://www.staradvertiser.com/2024/06/12/hawaii-news/fewer-than-half-of-hawaiis-keiki-proficient-in-reading-and-math/","thumb":"https://airtable.com/appbaSkkzqMtMDZvn/tbldguO6qNaiSKWxH/recsJh0kWly3v9ORJ/fldklFahcv3P8s5Fb/attsbc7vzTnxd3ZTz"},{"org":"Speaks","date":"2024-03-20","title":"Keiki Strong Rally urges support for early childhood care and education","publication":"Maui Now","excerpt":"A public rally is planned this Friday at the Maui County Building to advocate for early childhood care and education. The event is hosted by the Hawaiʻi Children’s Action Network Speaks (HCAN Speaks!) and the Hawaiʻi Early Childhood Advocacy Alliance (HECAA). The March 22 event starts with keiki entertainment at 9:30 a.m., the rally at 10 a.m., and a march at 11 a.m.","url":"https://mauinow.com/2024/03/20/keiki-strong-rally-urges-support-for-early-childhood-care-and-education/","thumb":"https://airtable.com/appbaSkkzqMtMDZvn/tbldguO6qNaiSKWxH/rec87keuFmtVNaxYa/fldklFahcv3P8s5Fb/att4y7eiIc1kspdHh"}]
